#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "12be6fe918952b2470803df4db8acbd9" -> "d689cd86c3bb37ff8d84458d1dd476b1"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "6357ebedd1c9ec8ea9741b9efc5c66ba" -> "33dd52bed4875fb102ab4548842a1a2e"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "253d4719f63a488f56604e7c2a77a743" -> "2b96c1627b6ee71e12daa202f192b455"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "cef5c5ce64919cfe5d1f9967a2530d54" -> "81aa66a59f01eecf3a674cc53fb6c489"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "89698d94850f871ca1d4142fe9efda01" -> "6e234806528bc2493cb996d05507aee4"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "b8e3ff781db1973eaa4ea6cea036dfb5" -> "3ad97430b3c3eb84683bc2efeb27e3c9"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "0ecd55e418614ebe164dc3b9ca4be98e" -> "96494689ab77b09d7c39e61ea66dff45"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "b818557f807f60408f2ff022c3b5ae63" -> "bc74c916fdf71e8f23b284b4f10078a7"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "d8c7786860fa7cbb22890f3a0d1696b9" -> "3dddf9714775a9a1d8bb1aacbb98b6c3"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "42cb98ebcbb5390f3b73d3fadd7a1b49" -> "b668d37e686962926d452e3e38347339"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "69cdd35d4a8c962ca98b71c7dc30b953" -> "db3e1c440b76632f031c901cec5d372a"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "8149826ac93f56855ee25f3b806adad5" -> "9200fdbb4325f7cd6c1c92b19bdb5f5e"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "6e49c98c7364c5efbee60b882a6c5f50" -> "5f6f29735f56ca6ec9c01ae1c5674043"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "b923e18455190f82e0e2c930f0b443d1" -> "f6e1aa31317cb6f9d7ba47f72f1e2056"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "251e95486f1f4fee9be2b26e908036de" -> "07310b91eaa920ba67d0e14d5b387240"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "e44ba4ae11f1b0036666fa196f7457a2" -> "7efc5bbab75548cfcdcdd959d439848a"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "2bab5d2d5c56d95acd6994eaf911298a" -> "9714eec5ab29320231e50e18615c8acb"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "eb8861dc58c1cb92a813ae6372c946d1" -> "9684870a38f3b49c13319dc57ac69f60"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "87bf2566d319e4c24e632007f439086f" -> "8c8b1fcc2285b60f31936cec1ea58526"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "1ee9498c8af79680766ecb3a68b69f94" -> "01316bf13180a9456137f691f3ac9df6"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "986312d9f32934ad0d5fdd0f7a44832e" -> "7b071de5cdb38d88aa02a44cdcd40864"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "2e77c62adedf80d1732c4c0a68c8ade3" -> "1475056886303fd077773ebf756466d3"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "5d6a7850616c62cc9d4a1a1d64ac8070" -> "6b154f16c881c5af758116d70ae3266e"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "b7a673479f5b4652bbfa420ea296207f" -> "cde1e145f52291395d9aec97370bead0"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "3778fac49358643d89b90d519a77ed65" -> "fb2046e623b21dfa26957de5381ad827"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "354df8a6f2ae07e32d3993395fdf6054" -> "a567d4c089857284bdbe14e49ed134a9"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "76ecb3a78304813a0e9e04ad5e9039f9" -> "315c1bf0db1e68544a622bafcea70205"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "08300282efebe487d8b58dd13bb88b66" -> "2009327a7c5cdf7908f4787f5bf4ca0e"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "491c6cc713fd3a3f4e3b5f79d7f5e569" -> "86cbcbb6fdbdd60ee579a64aa787d47b"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag               = "5cbe05e60b57c567698fa202a943e76e" -> "3e22cb2ea9d0ec72c4728b4701d0f2d6"
        id                 = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "c128c4847ce0bc58e9f79e92e07e5212" -> "d1a2d588fc4f511421ed20e282149ece"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "7e4c5b2242d96f44d2257dd9e69a866d" -> "f1289e5890842d9648f47925a51cbcf8"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "7784a8ce1318d390fc420168c3a44821" -> "515c7ecc5838251c17cad522a79b15fc"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "5e9accdfb294d4495c74187a4a15a4b3" -> "00bd987f460ef715fb596492ab733f13"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "2cd6ed72536462417dea6f9c81ba497c" -> "50f7bb70250168c175803d3fb64327db"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "1fb429dc87f27d7dac4310350e2cc8af" -> "ffd0e0101d82e6e03c1c6dd695e10734"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "0bcb593d4f484e6cbd10e9e3a94c6196" -> "a21a71aee7069335a450879e52d2418e"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "b8e26774a91b5f09ed38bbc62737c241" -> "b0bdc5f9616d3999887b3fce37fbe825"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag               = "870f2cfb0e5dbdefbe91ac2ad5d0c318" -> "d66f597c40aad9e83fdf1f9297aae855"
        id                 = "lambdas/demo/modify_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "9bd61dc2c806314f06caa02dea88a387" -> "33da411e373b2d7993e6c02e0a84b3ad"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "113a63c1fed40120c45967254d6d7f44" -> "d6ddae6bf9ecaa5f937a3d580d6a6083"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "246f57882b1694bbb531b7ccc903911a" -> "a3d355fd62e790b35a2e8a729c99593d"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "7761f2d55e143a17974de33561ad13cf" -> "54ef1ad6703d7d96a27614d5a03d573a"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "79e5c40fb183d362500a357f06241256" -> "e2a56f1d571a62a3d2cae55ee6d6bd9b"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "fb61efccea6e454d076b4d5616d99fff" -> "62c8d6ce1d03fd1ce23a7dba1fa72162"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "vQjV3miEiSxKt1au1FAjOl2qhJegnxngh9POhIlPXAs=" -> "PadclYtV0r8D56CD9oAFJv0l+fC98nqvR83Sfi73mYE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "+du9BtoQr++9bI0fjg9LKvdOQ5rNAZ0QLA9qdz9G3j8=" -> "9k4c6YqsevbSXztKKm5N5jRaJe+uM/8afEj/I+K1C0U="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "6LvvZocueXIWbSKK2SZAlmPJU82oF6bwJOSwZsmhw9w=" -> "1ssvQQuJQCXI3XY3uvMl3jk2wYd3df1GbLXOHrwFslE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "y0Pf/ZQkfl6CQQJfcAbAa9IQflsSA1/fnMaM3QECsSY=" -> "W/RRqryF7OLlvLpmX/EOUYlQJt1s5VlaJcrWXUfAwwg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "OAxx1IEz1S/mh3kQsNDWigX0GwhCgq9Ltuk++zPPOcI=" -> "8LaapqkAmDh5TSCiNfoIflCuSOZaX5yGfQc54N3hCGM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "5r+sk5M+GZYPqdTa34/Yr6vqr8O8R2dY8ChMXQD7dss=" -> "AdkijJuWuRN9yAvVREEJ53qfUPvcZ6Cm4tYbQ8P7tbc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "xGgCJZTTC7sGQJHfmiVrRYniA/lEwQjfwupO8P/4zHE=" -> "s+QpNvMUN/Wko7mp4V86WdXr6NKWs5J1QmwM1TbPbJo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "1Z/rZgEIYL9J/PELwAxQl+luNe0kGYBcKSSF0KJkm/Q=" -> "g2rvFdWnAqyZN4+NC8hFwmOnkNcORUwUW/IoFEr/6s8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-12-23T17:15:59.000+0000" -> (known after apply)
      ~ source_code_hash               = "tJipGbrvmggwkNz0r5nWmhAErhun7DzYAyhhXmMOGZc=" -> "qC8zbDzvziLJQUdHf5zFbSIl5SmWqZ4+UCJx601lQPI="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "ncoBHY4Fwn5WNOa4D+9liWwJLlNiHVMzqHcHsJ7N7JU=" -> "byOK+M+nY4ynrrVo0lYEEfg/fod/QYsE2kJWaM2HCuE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "AlDYHKVVnOnNNroEB64Md+oUBRNM4PCrMdf+eNoaRIo=" -> "0Mdxa0Syv5JcunV5tK7wg22UjoKo86/JuzU7P5fE+Hg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "dGL8f71LvK1CFzZim9D+uaGf6+TeIQHSvb8Sr1QGk4k=" -> "dPvU2zWlT90cNOWdfHiPSKXk40oHATCuO8Ea8qNMeeQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "hgF1c1oML+8x6HXbNLrGRpHUS7ihWATgGGdfaZ2xce8=" -> "aYzNLxm+MHbDbfSG2GIePsonh39thYlFlrkMwEnr9as="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "7c11mxPr7jWrk9c0XK+XwjIMhTaDWAUFLAndt3JfwPM=" -> "t0bPMzPwAbq43sBYfB3m+E5UwS246G/GdhorrUhaFkQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "fm8dRGBZfcsP9pmlnGFArj1f8D/xa95Ullzwszk5SWw=" -> "KsOis+ZLXMRBlQYXh+C/0nXnTtWkr5Tr+X2BpepvnFY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:04.000+0000" -> (known after apply)
      ~ source_code_hash               = "nVK927GqGiYQ8zg7l/9JiCZjzkKzQuhsSrDmwRmaEzs=" -> "MVlrHaXekMHdTwV5T5WlDt7keq+JB4g+P4D0iUhAhnc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "fKX8HLYMCE9RFB66xVIIQyR2+v18Vz0mX+0NkoT+1Ls=" -> "MSk//ipRrF++dtKkynww5b6I4KjcycJGICmRbHB/FOs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "E5Nd8cjj3Vyf6nOwsazQ7ROlaaRpUGvjn57RFBpGWgk=" -> "Q9+GKJwrLG7FYfDGTn3KdcKoYAgh0gmhUc4yegIQ04c="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "a1Aeig1tSiG79m2vJqi7QqBm5tQBipAn67FyV5lPN2s=" -> "5FGR8mZqH59SFiDJQDYYVCvj6fll0D9xF69He12TAHc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "wNH0fFag4SRVKl4kpRqnu0CRj6NpmUHZtzjmvTrlkgE=" -> "HeSkvk7iSYSYbhScHdf1C+NRlVmLNIGAQX+KUAzjmKQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:13.000+0000" -> (known after apply)
      ~ source_code_hash               = "rwXpQbtuAOhuOgS8Ew1VzN5kmIElr27HS7JFHETWr98=" -> "Zh4IO/vXMGLcK6MkKc1vlhkt6O2hHpsxB+OPYQhBDks="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "KdVvkK/K/oNs7iNexfBnucpXLjOOIjcLIhf4rnRFXlA=" -> "/XBNugo2Ng/C1/AHOsir7/+kG6vdfUf+2SGfsQ2AtLI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "YUMESgSdkAamqWFJ695vrjWT3aZbJKkgYCxtZGo3pSM=" -> "4xQC0wDldu5p7A0uQKrVv8raz/DxNs1Fe8WIu4otGkY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "4Uuc26p5Ua0tQ+oa68SpC8GBGKHh0vW6PJxrfmFlsbk=" -> "WzG5O54wYULAwlWECuGyx52ngXAKG3kSOfADv6jgc9k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "8W23oeV51AgM40bRWLG3FZslJpRQYv9ID3zxjYaKxTA=" -> "By9WgAVOUvp1LOCycJ+FBca4VIZ+pZxaNnlSYQQmptY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "V+pWDdXHx+GFVCZ9+93NlFzRdBZPTJJs/aJI/PS8xD0=" -> "rtTtLSwYUfk0MxOz/KwEUfEk8qc+h0AuzbuCLQsSMbM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "25NONkmjsYIs0lAoSMIePDbODnWP85t+ZwAsc7eTxkw=" -> "ALi5sELt2VZJ6zeZjNkSnFyMg/wnIScaCu7LV4M0tFI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:20.000+0000" -> (known after apply)
      ~ source_code_hash               = "5QzhyBsyArTRK6fXa6VuljbawEhn//kKdPdJeV7d204=" -> "CoTVzikpfNJo5eKaiaKrnCIowK2+RDsbIQbuFwD8DmY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "qQvzDx8TC/tO5m0R77OWwdBEzSBswmzjaCoLwnQRcq0=" -> "eCBB8erCA8CMjf2bLUrapY7Uf1GQFQjOfVxR6brJwj8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "3VHsJo57zefZi5eSt2jGXC6FmKimMSCi8tLcb1gh0iY=" -> "a5nxNbj6OICSXzoUdyPcFIC4GlVJsYhdbIzUdw3ugF8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "EwbbTTqcel++N1LQcqIG5gm8MqL6KC5o2ERk/2TFJ8Y=" -> "XCr7gonXFFf0CzIdeftP1KkDWaNLQoD4NzOUSzSymag="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "3qQeqGv25s5Q5joyMcr2s+GfHOzv/hRwjf8OAGDDTtg=" -> "rxJ4T3zT2RlGny9GrodejMhKEF0Q8YkqqPfpfBXci3A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "Ke9YIPF+M4/5M3YvfuIWX4URDfo0IK4nukDzU0PhfAA=" -> "orjrRUawKnjjZ0SzzvcP7toN+/ODOSn8vTmcdTTQZf8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "RDB5OqNWLMT+luMR3mg4q/PxlIl9ZnKP5QNOQa1t20w=" -> "2lIdQRztR+VihUKdHgIcCmOcybabPorFayWX5LJm19k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "oMrnbQYRpfRsvOMI9x/1+q4YX19SMLbxwQhx0dK9b8Y=" -> "Y85gUYvG7OfRPutEaFA/t6ClSn2etqImO+3fdwWyNsM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "FIAPBZNekYqw90fsGTWceNSh0jjdDkKIPvlVxhsYGn8=" -> "LCAOldObjjHsgr+QJJstM0f17+meLSFUtzH6IZUep+I="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "dJG6p2oM7OuymOe+PcvZ/DWDS8afuvKpfKVaR9uuudc=" -> "Q4oD9gn/EkSR5GshQhjZJtxeIwZB6bp+S5jEaydaxRk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "bjQr7ef2Uh4nojOSyOfO/UlSDsFGUzVuNpaoZANG2Ac=" -> "L0Ey5L3s1JGXUY6wBnAnXvQT8nX9w+luDX0WLyxJaDw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "9uOPy0M48qikSpxXbxsIy+MO4qHb7mVsDhBIGjqq5yU=" -> "sqrm9biY2Nvlmtv961QJhd2wOL0QEfi7FI3J4AOE86A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "LLbXKUnhCmE2596TkRIZXmro/UGy5pMT0O+rHEFLxBI=" -> "jHmPmsRJClS45w3nBHJK8G2OO9jtNrKB4iG7Ncvk5x8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "x0inBNH7plKcWz2gy6wIdN6XOMQl7blFTQVo8i8I+ks=" -> "ZgRiLPgSg/IMOlsgmGE9sxd+5DaZeUOASfGkOl2V/oo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:08.000+0000" -> (known after apply)
      ~ source_code_hash               = "S781DeSkUnA93CrnkhOfeF/ufi4Id3cR1efLiMURZTY=" -> "FXWEsC76xuzkN2j/3UAzjW854Gqg+8TDBFw9aULx6Uc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "DShmEgmzMI9CaLUBjJIxu47uDlMTm4g+jYysAippq8I=" -> "R7Wg6C/tgWiUb08BFhDviJiH3Fu7xQVatpiqoSk50Fc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-12-23T17:16:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "ly/bcaTeb6X4kPxrwUSqMN+xORie+KVLoNieP4lWZzs=" -> "W2EYFtaeiyhc7pBj1EVtTdpxQyiZVmEv4oXFxpLmoQg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-12-23T17:15:59Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "8p3hvm" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-12-23T17:15:58Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-12-23T17:15:55Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 91 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @FreddyJR1995, Action: `pull_request`*